<?php
// 作业1：2012年培养学员25万人，每年增长25%，请问按此增长速度，到哪一年培训学员人数将达到100万人？

$y = 2012;
for ($x = 25; $x <= 100; $x += ($x * 0.25)) {
    $x = (int) $x;
    $y++;
}
echo $y . "年将达到人数一百万人";
echo "<br>";

// 作业2：1~10之间的整数相加，得到累加值大于20的当前数。
$sum = 0;
for ($math = 1; $math <= 10; $math++) {
    $sum += $math;
    if ($sum > 20) {
        echo $sum . "<br>";
        break;
    }
}

// 作业3：打印九九乘法表。
for ($i = 1; $i <= 9; $i++) {
    for ($j = 1; $j <= $i; $j++) {
        echo $i . "*" . $j . "=" . $i * $j . "&nbsp;&nbsp;";
    }
    echo "<br>";
}

?>